## Terraform Plan
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 3 to add, 0 to change, 6 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                                NAME                                                 |
|----------|-----------------------------------------------------------------------------------------------------|
| delete   | `module.saas_app_service_principal.azuread_application.sp_app[0]`                                   |
|          | `module.saas_app_service_principal.azuread_service_principal.sp[0]`                                 |
|          | `module.saas_app_service_principal.azuread_service_principal_password.sp_password[0]`               |
| recreate | `azurerm_monitor_action_group.SRE_GR_AG`                                                            |
|          | `module.breakglass_account_signin_attempt.azurerm_monitor_scheduled_query_rules_alert_v2.this`      |
|          | `module.conditional_access_policy_modification.azurerm_monitor_scheduled_query_rules_alert_v2.this` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_monitor_action_group.SRE_GR_AG must be replaced
-/+ resource "azurerm_monitor_action_group" "SRE_GR_AG" {
      ~ id                  = "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/actionGroups/SRE-GR-AG" -> (known after apply)
        name                = "SRE-GR-AG"
      ~ resource_group_name = "pubsec-central-logging-rg-prod" -> "cds-snc-mgmt" # forces replacement
        tags                = {
            "ClientOrganization" = "cds-snc"
            "CostCenter"         = "sentinel"
            "DataSensitivity"    = "U"
            "ProjectContact"     = "Security@CDS"
            "ProjectName"        = "Sentinel"
            "TechnicalContact"   = "security@cds-snc.ca"
            "ssc_cbrid"          = "21JA"
        }
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.breakglass_account_signin_attempt.azurerm_monitor_scheduled_query_rules_alert_v2.this must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "this" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/scheduledQueryRules/Breakglass Account Signin Attempt" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "Breakglass Account Signin Attempt"
      ~ resource_group_name                    = "pubsec-central-logging-rg-prod" -> "cds-snc-mgmt" # forces replacement
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.OperationalInsights/workspaces/log-analytics-workspace-prod" -> "/subscriptions/6881deca-df81-4b95-ad54-103b0b100a1d/resourceGroups/cds-snc-mgmt/providers/Microsoft.OperationalInsights/workspaces/cds-snc-la",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "ClientOrganization" = "cds-snc"
            "CostCenter"         = "sentinel"
            "DataSensitivity"    = "U"
            "ProjectContact"     = "Security@CDS"
            "ProjectName"        = "Sentinel"
            "TechnicalContact"   = "security@cds-snc.ca"
            "ssc_cbrid"          = "21JA"
        }
      - target_resource_types                  = [] -> null
        # (11 unchanged attributes hidden)

      ~ action {
          ~ action_groups     = [
              - "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/actionGroups/SRE-GR-AG",
            ] -> (known after apply)
          - custom_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

  # module.conditional_access_policy_modification.azurerm_monitor_scheduled_query_rules_alert_v2.this must be replaced
-/+ resource "azurerm_monitor_scheduled_query_rules_alert_v2" "this" {
      ~ created_with_api_version               = "2023-03-15-preview" -> (known after apply)
      ~ id                                     = "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/scheduledQueryRules/Conditional Access Policy Modification" -> (known after apply)
      ~ is_a_legacy_log_analytics_rule         = false -> (known after apply)
      ~ is_workspace_alerts_storage_configured = false -> (known after apply)
        name                                   = "Conditional Access Policy Modification"
      ~ resource_group_name                    = "pubsec-central-logging-rg-prod" -> "cds-snc-mgmt" # forces replacement
      ~ scopes                                 = [ # forces replacement
          ~ "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.OperationalInsights/workspaces/log-analytics-workspace-prod" -> "/subscriptions/6881deca-df81-4b95-ad54-103b0b100a1d/resourceGroups/cds-snc-mgmt/providers/Microsoft.OperationalInsights/workspaces/cds-snc-la",
        ]
      - skip_query_validation                  = false -> null
        tags                                   = {
            "ClientOrganization" = "cds-snc"
            "CostCenter"         = "sentinel"
            "DataSensitivity"    = "U"
            "ProjectContact"     = "Security@CDS"
            "ProjectName"        = "Sentinel"
            "TechnicalContact"   = "security@cds-snc.ca"
            "ssc_cbrid"          = "21JA"
        }
      - target_resource_types                  = [] -> null
        # (11 unchanged attributes hidden)

      ~ action {
          ~ action_groups     = [
              - "/subscriptions/f27b081a-aa54-4ab4-9f26-a4c5375dc8fa/resourceGroups/pubsec-central-logging-rg-prod/providers/Microsoft.Insights/actionGroups/SRE-GR-AG",
            ] -> (known after apply)
          - custom_properties = {} -> null
        }

        # (1 unchanged block hidden)
    }

  # module.saas_app_service_principal.azuread_application.sp_app[0] will be destroyed
  # (because azuread_application.sp_app is not in configuration)
  - resource "azuread_application" "sp_app" {
      - app_role_ids                   = {} -> null
      - client_id                      = "26ef250d-0c0f-41e9-bd0b-ee1fcb7a0859" -> null
      - device_only_auth_enabled       = false -> null
      - display_name                   = "saas-app-service_principal" -> null
      - fallback_public_client_enabled = false -> null
      - group_membership_claims        = [] -> null
      - id                             = "/applications/d7d5b36c-514d-4a7b-8fcd-79dee8505aff" -> null
      - identifier_uris                = [] -> null
      - oauth2_permission_scope_ids    = {} -> null
      - oauth2_post_response_required  = false -> null
      - object_id                      = "d7d5b36c-514d-4a7b-8fcd-79dee8505aff" -> null
      - owners                         = [] -> null
      - prevent_duplicate_names        = false -> null
      - publisher_domain               = "cdssnc.onmicrosoft.com" -> null
      - sign_in_audience               = "AzureADMyOrg" -> null
      - tags                           = [] -> null
        # (11 unchanged attributes hidden)

      - api {
          - known_client_applications      = [] -> null
          - mapped_claims_enabled          = false -> null
          - requested_access_token_version = 1 -> null
        }

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - optional_claims {
        }

      - public_client {
          - redirect_uris = [] -> null
        }

      - single_page_application {
          - redirect_uris = [] -> null
        }

      - web {
          - redirect_uris = [] -> null
            # (2 unchanged attributes hidden)

          - implicit_grant {
              - access_token_issuance_enabled = false -> null
              - id_token_issuance_enabled     = false -> null
            }
        }
    }

  # module.saas_app_service_principal.azuread_service_principal.sp[0] will be destroyed
  # (because azuread_service_principal.sp is not in configuration)
  - resource "azuread_service_principal" "sp" {
      - account_enabled               = true -> null
      - alternative_names             = [] -> null
      - app_role_assignment_required  = false -> null
      - app_role_ids                  = {} -> null
      - app_roles                     = [] -> null
      - application_tenant_id         = "221ca1d3-b3f2-4346-8abc-88f802495c7d" -> null
      - client_id                     = "26ef250d-0c0f-41e9-bd0b-ee1fcb7a0859" -> null
      - display_name                  = "saas-app-service_principal" -> null
      - id                            = "/servicePrincipals/5b4dea77-d623-4fbf-95ba-f1fe398bf7a2" -> null
      - notification_email_addresses  = [] -> null
      - oauth2_permission_scope_ids   = {} -> null
      - oauth2_permission_scopes      = [] -> null
      - object_id                     = "5b4dea77-d623-4fbf-95ba-f1fe398bf7a2" -> null
      - owners                        = [] -> null
      - redirect_uris                 = [] -> null
      - service_principal_names       = [] -> null
      - sign_in_audience              = "AzureADMyOrg" -> null
      - tags                          = [] -> null
      - type                          = "Application" -> null
        # (7 unchanged attributes hidden)

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - saml_single_sign_on {
            # (1 unchanged attribute hidden)
        }
    }

  # module.saas_app_service_principal.azuread_service_principal_password.sp_password[0] will be destroyed
  # (because azuread_service_principal_password.sp_password is not in configuration)
  - resource "azuread_service_principal_password" "sp_password" {
      - end_date             = "2027-02-24T20:58:24.5174873Z" -> null
      - id                   = "5b4dea77-d623-4fbf-95ba-f1fe398bf7a2/password/7afdd3da-00ab-4c71-9ac9-7988c369eef9" -> null
      - key_id               = "7afdd3da-00ab-4c71-9ac9-7988c369eef9" -> null
      - service_principal_id = "/servicePrincipals/5b4dea77-d623-4fbf-95ba-f1fe398bf7a2" -> null
      - start_date           = "2025-02-24T20:58:24.5174873Z" -> null
      - value                = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["azurerm_monitor_action_group.SRE_GR_AG"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers_api_key.azurerm_resource_group.rg"]
WARN - plan.json - main - Missing Common Tags: ["module.breakglass_account_signin_attempt.azurerm_monitor_scheduled_query_rules_alert_v2.this"]
WARN - plan.json - main - Missing Common Tags: ["module.conditional_access_policy_modification.azurerm_monitor_scheduled_query_rules_alert_v2.this"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_core_hackathon_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_core_hackathon_api_key.azurerm_resource_group.rg"]
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_resource_group.rg"]

28 tests, 19 passed, 9 warnings, 0 failures, 0 exceptions

```

</details>
